//;******************************************************************************
//;* Copyright (c) 1983-2012, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//;
//; Abstract:
//;
//;   String definitions for GenericBdsLib.
//;

/=#

#langdef eng "English"
#langdef fra "Français"
#langdef zho "\wide中文\narrow"
#langdef jpn "\wide日本語\narrow"
#langdef ita "Italian"
#langdef spa "Spanish"
#langdef ger "German"
#langdef por "Portuguese"

#string STR_DESCRIPTION_FLOPPY         #language eng  "EFI Floppy"
                                       #language fra  "EFI Floppy"
                                       #language zho  "EFI Floppy"
                                       #language jpn  "EFI Floppy"
                                       #language ita  "EFI Floppy"
                                       #language spa  "EFI Floppy"
                                       #language ger  "EFI Floppy"
                                       #language por  "EFI Floppy"
#string STR_DESCRIPTION_CD_DVD         #language eng  "EFI DVD/CDROM"
                                       #language fra  "EFI DVD/CDROM"
                                       #language zho  "EFI DVD/CDROM"
                                       #language jpn  "EFI DVD/CDROM"
                                       #language ita  "EFI DVD/CDROM"
                                       #language spa  "EFI DVD/CDROM"
                                       #language ger  "EFI DVD/CDROM"
                                       #language por  "EFI DVD/CDROM"
#string STR_DESCRIPTION_HARDDRIVE      #language eng  "EFI HDD Device"
                                       #language fra  "EFI HDD Device"
                                       #language zho  "EFI HDD Device"
                                       #language jpn  "EFI HDD Device"
                                       #language ita  "EFI HDD Device"
                                       #language spa  "EFI HDD Device"
                                       #language ger  "EFI HDD Device"
                                       #language por  "EFI HDD Device"
#string STR_DESCRIPTION_USB            #language eng  "EFI USB Device"
                                       #language fra  "EFI USB Device"
                                       #language zho  "EFI USB Device"
                                       #language jpn  "EFI USB Device"
                                       #language ita  "EFI USB Device"
                                       #language spa  "EFI USB Device"
                                       #language ger  "EFI USB Device"
                                       #language por  "EFI USB Device"
#string STR_DESCRIPTION_SCSI           #language eng  "EFI SCSI Device"
                                       #language fra  "EFI SCSI Device"
                                       #language zho  "EFI SCSI Device"
                                       #language jpn  "EFI SCSI Device"
                                       #language ita  "EFI SCSI Device"
                                       #language spa  "EFI SCSI Device"
                                       #language ger  "EFI SCSI Device"
                                       #language por  "EFI SCSI Device"
#string STR_DESCRIPTION_ISCSI          #language eng  "EFI ISCSI Device"
                                       #language fra  "EFI ISCSI Device"
                                       #language zho  "EFI ISCSI Device"
                                       #language jpn  "EFI ISCSI Device"
                                       #language ita  "EFI ISCSI Device"
                                       #language spa  "EFI ISCSI Device"
                                       #language ger  "EFI ISCSI Device"
                                       #language por  "EFI ISCSI Device"
#string STR_DESCRIPTION_MISC           #language eng  "EFI Misc Device"
                                       #language fra  "EFI Misc Device"
                                       #language zho  "EFI Misc Device"
                                       #language jpn  "EFI Misc Device"
                                       #language ita  "EFI Misc Device"
                                       #language spa  "EFI Misc Device"
                                       #language ger  "EFI Misc Device"
                                       #language por  "EFI Misc Device"
#string STR_DESCRIPTION_NETWORK        #language eng  "EFI Network"
                                       #language fra  "EFI Network"
                                       #language zho  "EFI Network"
                                       #language jpn  "EFI Network"
                                       #language ita  "EFI Network"
                                       #language spa  "EFI Network"
                                       #language ger  "EFI Network"
                                       #language por  "EFI Network"
#string STR_DESCRIPTION_SHELL          #language eng  "Internal EFI Shell"
                                       #language fra  "Internal EFI Shell"
                                       #language zho  "Internal EFI Shell"
                                       #language jpn  "Internal EFI Shell"
                                       #language ita  "Internal EFI Shell"
                                       #language spa  "Internal EFI Shell"
                                       #language ger  "Internal EFI Shell"
                                       #language por  "Internal EFI Shell"
